
#pragma once

#include "quick3d_global.h"

// Application
#include "CQ3DConstants.h"
#include "CMesh.h"
#include "CHeightField.h"

//-------------------------------------------------------------------------------------------------

class QUICK3D_EXPORT CWater : public CMesh, public CHeightField
{
public:

    //-------------------------------------------------------------------------------------------------
    // Constructeurs et destructeur
    //-------------------------------------------------------------------------------------------------

    //!
    CWater(C3DScene* pScene, double dSize, int iIterations);

    //!
    virtual ~CWater();

    //-------------------------------------------------------------------------------------------------
    // Setters
    //-------------------------------------------------------------------------------------------------

    //-------------------------------------------------------------------------------------------------
    // Getters
    //-------------------------------------------------------------------------------------------------

    //-------------------------------------------------------------------------------------------------
    // Méthodes héritées
    //-------------------------------------------------------------------------------------------------

    //! Retourne le nom de la classe
    virtual QString getClassName() const { return ClassName_CWater; }

    //! Méthode de mise à jour avec temps delta depuis la dernière itération
    virtual void update(double dDeltaTime);

    //! Dans cette méthode, l'objet doit faire son rendu
    virtual void paint(CRenderContext* pContext);

    //!
    virtual double getHeightAt(const CGeoloc& gPosition, double* pRigidness = NULL);

    //-------------------------------------------------------------------------------------------------
    // Méthodes de contrôle
    //-------------------------------------------------------------------------------------------------

    //-------------------------------------------------------------------------------------------------
    // Propriétés
    //-------------------------------------------------------------------------------------------------
};
